package com.tyqhwl.jrqh.base;


public class NewMessage {

    public static final String RUDIMENT_FIRST = "   股票的基本面是指该上市公司的业绩，经营情况等，包括：公司股本、每股收益、流通股本、公司盈利能力、发展前景等公司综合基本数据。基本面包括宏观经济运行态势和上市公司基本情况。宏观经济运行态势反映出上市公司整体经营业绩，也为上市公司进一步的发展确定了背景，因此宏观经济与上市公司及相应的股票价格有密切的关系。上市公司的基本面包括财务状况、盈利状况、市场占有率、经营管理体制、人才构成等各个方面。 基本面分析是指对宏观经济、行业和公司基本情况的分析，包括公司经营理念策略、公司报表等的分析。长线投资一般用基本面分析。 基本面的分析: 1、分析立场 投资者对汇市的基本面分析与股市的不同。股市的基本面分析，除了要对宏观的国家经济政策进行评价之外，还需要对企业出台的相关融资策略、鼓励分配政策、经营状况等进行分析才能得出股票价格的变动趋势。由于汇率的变化是两个国家之间整体经济状况变化的结果，所以在对汇市进行分析时，投资者要从整体上即宏观上去分析国家的政治经济局势，而舍弃微观的经济状况分析。 2、分析经济数据 投资者对走势的基本面分析，就是对国家一系列经济数据的分析。不同的国家与汇率变化相联系的经济数据是不一样的。应该掌握各个国家基本面的数据名称和这些数据的变化对汇率的影响。 投资者面对众多的数据，不是每一个都要求对其进行分析，投资者要学会根据当前的世界政治经济局势，从零碎的消息和数据中找到市场的热点。在对基本面进行分析时， 主要分析这些市场的热点就可以了。但投资者要注意，市场的热点并不是固定不变的，随着政治经济环境发生变化，热点也会随着发生变化。例如，美国一向看重的贸易赤字，在当今利率升高可以吸引国外资本流入的情况下，对的影响就不如前一段时间强了。 3、现在的热点问题 不同的国家我们关注的热点问题是不一样的。例如美国，投资者应该关注利率的走势（目前美国正处在加息周期，步伐的快慢影响着的走势）、贸易赤字、就业报告、资本流入、季度GDP等，英国应关注通货膨胀率和降息的预期，区应关注区经济增长率、物价指数等，日本应关注经济增长、人民币升值的预期等。另外，还应该关注世界上的一些信息，包括石油价格问题、台海局势、朝核问题等。 股票基本面分析: 在把自己的血汗钱拿出来投资股票之前，一定要分析研究这只股票是否值得投资。以下的步骤，将教你如何进行股票的基本面分析。 所需步骤： 1．了解该公司。多花时间，弄清楚这间公司的经营状况。以下是一些获得资料的途径： * 公司网站 * 财经网站和股票经纪提供的公司年度报告 * 图书馆 * 新闻报道——有关技术革新和其它方面的发展情况 2． 美好的前景。你是否认同这间公司日后会有上佳的表现？ 3． 发展潜力、无形资产、实物资产和生产能力。这时，你必须象一个老板一样看待这些问题。该公司在这些方面表现如何？ * 发展潜力——新的产品、拓展计划、利润增长点？ * 无形资产——知识版权、专利、知名品牌？ * 实物资产——有价值的房地产、存货和设备？ * 生产能力——能否应用先进技术提高生产效率？ 4． 比较。与竞争对手相比，该公司的经营策略、市场份额如何？ 5． 财务状况。在报纸的金融版或者财经网站可以找到有关的信息。比较该公司和竞争对手的财务比率： * 资产的账面价值 * 市盈率 * 净资产收益率 * 销售增长率 6． 观察股价走势图。公司的股价起伏不定还是稳步上扬？这是判断短线风险的工具。 7． 专家的分析。国际性经纪公司的专业分析家会密切关注市场的主要股票，并为客户提供买入、卖出或持有的建议。不过，你也有机会在网站或报纸上得到这些资料。 8． 内幕消息。即使你得到确切的内幕消息：某只股票要升了，也必须做好分析研究的功课。否则，你可能会惨遭长期套牢之苦。 技巧提示： 长期稳定派息的股票，价格大幅波动的风险较小。 ";
    public static final String RUDIMENT_SECOND= "   投资是一个比较大的概念，你投资一个实体店，或者是投资互联网项目，或者投资到股市、基金以及理财中，都属于投资。根据题主的问题描述，题主关心的主要是股市中的投资误区，新手在哪些方面最容易犯错误呢？\n" +
            " \n" +
            "    第一点，根本就不了解股票对应的公司。就如同投资实体店一样，你必须了解周边的消费情况、人流情况，了解具体开店的人的能力……而股市中，你购买一支股票，实际上就是投资了，但很多人根本没了解股票对应的公司经营情况、未来发展、业绩报表等，很多人都是凭着朋友或者一些群、一些论坛的推荐瞎买，就是几个代码而已。试想，这样的投资赚钱的几率能有多高呢？\n" +
            " \n" +
            "    第二点，同时持有多支股票。很多新手因为不了解股票，不了解股票对应的公司的情况，所以，他们的理论是为了降低风险，所以，多买几支股票，总有两支会涨，纯粹是碰运气的感觉。手里几万块钱的投资，却买了七八支股票，每支股票买100-200股，结果呢？可能真的有那么一支股票涨了点，但是大部分都跌了，即使偶尔有涨的，也不足以弥补其他股票的亏损。所以，就不停地换股票，这倒是让证券公司高兴了，因为可以收取交易的手续费。\n" +
            " \n" +
            "    第三点，过于追逐利润，超短线操作。短线炒股本身也是一种策略，但是很多新手其实不懂那么多，巴不得今天买进，明天卖出就赚钱。实际情况是，有的好股票，稍微涨一点，他们就卖掉了，实际也没赚钱，但是更多的股票本身就亏损，所以最终大致大部分新手股民都是亏损状态。";

    public static final String RUDIMENT_THREAD = "   CFDs是差价合约，是Contracts for Differences的英文缩写。由于差价合约与股票、期货相比有很大的优势，所以差价合约自首次被个人投资者交易以来发展迅速。以下简要介绍差价合约不同于股票和期货等其他投资产品的特点：\n" +
            "\n" +
            "    杠杆作用\n" +
            "\n" +
            "          CFDs是杠杆交易品种，投资者只需要利用少量的保证金进行交易，无需占用大量的资金。\n" +
            "\n" +
            "    极具竞争力的最低保证金比例\n" +
            "\n" +
            "          交易只占用投资者5%-10%的合约金额作为保证金。\n" +
            "\n" +
            "    低交易成本\n" +
            "\n" +
            "          由于CFDs并没有真正交割股票，股票的所有权并没有发生转移，所以英国法律下CFDs交易是不需要交印花税的. 另外CFDs交易产生极低的交易佣金而且没有其他交易费用。\n" +
            "\n" +
            "    可以做空\n" +
            "\n" +
            "          无论是价格上涨还是下跌，投资者都可以通过交易获利。在价格下跌时可以通过做空获利。\n" +
            "\n" +
            "    快速交易执行力\n" +
            "\n" +
            "          交易员会在第一时间处理交易指令。\n" +
            "\n" +
            "    风险对冲\n" +
            "\n" +
            "          如果你是股票的持有者，并且即使在该股价下跌的时候你仍然希望持有股票，那么你可以在持有股票的同时在差价合约上面做空。这样股价下跌给你带来的损失能够用CFDs上面的盈利填补，同时风险即对冲掉了，这在股票或者股票投资组合都适用。\n" +
            "\n" +
            "    分红\n" +
            "\n" +
            "          如同你购买且持有股票，在CFDs上做多你也可以享有相应的分红。但是如果你在CFDs上是做空的话，那么同样的，分红会从你的账户上面被相应扣除。如果你只是持有CFDs而不是股票，那么你就没有相应的股东投票选举的权利。\n" +
            "\n" +
            "    短期投资\n" +
            "\n" +
            "          CFDs的高杠杆性和无需缴纳印花税的特性使其成为相当理想的短期投资交易品种。\n";
    public static final String RUDIMENT_FOUR = "    最近这几年，贵金属的发展是显而易见的，越来越多的人都参与到了这一类的投资模式中，有许多人都从中获得了巨大的利润，但是，我也常常会听到一些负面的声音，比如：贵金属投资黑平台等等。在这里，我想仔细的跟大家说一说贵金属到底是什么样的。\n" +
            "　　如果你被贵金属的平台坑过，那我想问你：在你选择贵金属的投资平台时，是否有认真的检查过这家公司的正规性呢？如果，没有，被坑是正常的，不要说是贵金属投资，任何行业都有骗子，所以我希望大家不要以偏概全。\n" +
            "　　在强调了上面的内容以后，我想跟大家说说贵金属投资的一些优点。\n" +
            "　　一、贵金属投资可以进行双向交易。即无论价格上升或者下降，只要你选择方向，则便可以赚钱；\n" +
            "　　二、贵金属投资风险可控。在操作中，我们可以自行设置止损，这样就可以把我们的损失降为最低，并且可以提前知道最大亏损成都，一切尽在掌握；\n" +
            "　　三、贵金属投资24小时交易。全天内扣除凌晨四点到七点的结算时间，您可以在任意时间进行操作，无论是建仓或者平仓；\n" +
            "　　四、贵金属投资无庄家幕后操作。区别于股票，贵金属投资不存在后台操作的问题，不会损害客户的利益；\n" +
            "　　五、手续费固定且低；\n" +
            "　　六、贵金属投资灿在杠杆。即1元钱可以抵50元来使用，降低了对您资金量的要求；\n" +
            "　　七、存款全部存于银行内。故此，投资者不必担心自己的资金安全。\n" +
            "　　以上只是我总结的一小部分贵金属的优势，之后我也会陆续提供相关信息，有兴趣的人可以继续关注。 ";
    public static final String RUDIMENT_FIVE = "    投资金融市场指债权人与债务人借助各种金融工具和有价证券而融通投资资金的场所。投资金融市场分为短期投资金融市场和长期投资金融市场。短期投资金融市场，一般在期限一年以内的融通投资资金，主要进行短期投资资金拆借，发行各种短期债券。其包括短期投资资金拆借市场、短期证券贴现市场和短期债券交易市场等。长期投资金融市场，一般在期限一年以上的融通投资资金，主要进行长期投资资金借贷，发行各种长期债券，发行股票。其包括长期投资资金借贷市场、长期债券交易市场、股票市场等。投资企业可以根据自己对投资资金占用时间的不同需要，在投资金融市场上出售股票或债券和借入资金。 [1] \n" +
            "持有者可以根据自己的不同需要，在投资金融市场上自由选择不同时期的投资，购入股票或债券和借出资金。在我国社会主义有计划的商品经济条件下，国民经济的市场机制是有计划的，这决定了投资金融市场也是有计划的商品经济市场。在国家有计划的领导下，投资专业银行是投资金融市场的组织者和管理者，可以用投资信息指导和经济手段，引导投资金融市场上的投资资金，用于国家急需的投资项目上，控制投资规模、发挥投资效益，保证客观控制和微观搞活。";

    public static final String RUDIMENT_SEX = "     现代企业风险的防范和控制   随着市场竞争的日趋激烈，风险对企业生存发展的影响也愈来愈大，现代企业必须充分了解财务风险的成因，建立完善风险控制机制，防范和化解企业发展中的各种财务风险，确保企业向着合理、科学、健康的方向发展。 风险防范 风险是指由于多种因素的作用，使企业不能实现预期财务收益，从而产生损失的可能性。财务风险是现代企业面对市场竞争的必然产物，它的存在会对企业生产经营产生重大影响。因此，如何客观地分析和认识财务风险，采取各种措施控制和避免财务风险的发生，对现代企业的生存和发展具有十分重要的意义。 二、现代企业财务风险的防范和控制 1．完善财务管理系统，以适应不断变化的财务管理环境 财务管理的宏观环境虽然客观存在于企业之外,企业无法对其施加影响或加以控制,但并不意味着企业面对环境变化就无能为力。首先，企业应对不断变化的财务管理宏观环境认真分析，把握其变化趋势及规律，并制定多种应变措施，适时调整财务管理政策，改变财务管理方法，从而提高企业对财务管理环境变化的适应能力和应变能力，以此降低和规避因环境变化给企业带来的财务风险。其次，面对不断变化的财务管理环境，财务管理体系应与时俱进，不断更新、完善。企业应设置合理、高效的财务管理机构，配备高素质的财务管理人员，健全财务管理规章制度，强化财务管理的各项基础工作，使企业财务管理系统高效运行，以防范因财务管理系统不适应环境变化而产生的财务风险。 2．强化财务风险防范意识，树立正确的财务风险观念 在市场经济的激烈竞争中，树立风险意识，勇于承担并善于分散风险是现代企业成功的关键。因此，现代企业必须树立正确的财务风险观念，遵守风险收益均衡的原则，不能只顾收益而不考虑发生损失的可能性。企业各部门、各人员，特别是企业的决策管理部门和财务管理人员必须增强风险防范意识，将风险防范意识渗透于财务管理工作的各个环节。财务管理人员要掌握扎实的财会专业知识，具备财务信息的收集、整理和分析能力；要具有对财务风险的敏感的、准确的职业判断能力，及时、准确地估计和发现潜在的财务风险,并能对具体环境下的风险作出判断和提出解决方案。 3．提高财务决策的科学化水平 财务决策的正确与否直接关系到财务管理工作的成败，在决策过程中，应充分考虑影响决策的各种因素，采用定量计算及分析方法，并运用科学的决策模型进行决策。如在筹资决策中，企业应根据生产经营情况合理预测资金需要量，然后通过对资金成本的计算分析及各种筹资方式的风险分析，选择正确的筹资方式，确定合理的资金结构，并在此基础上做出正确的筹资决策，以降低筹资成本，减少财务风险。在投资决策中，企业要坚持以效益为中心的投资原则，统一使用资金，使资金投向配置更合理，既要避免过分分散又要避免过分集中。同时通过投资回收期、投资报酬率、净现值及内部报酬率等指标对投资项目进行综合分析评价，从而避免财务决策失误所带来的财务风险。 4．加强企业内部管理，理顺企业内部财务关系 加强企业内部管理，调整资金及资产结构，减少和降低不合理的资金占用，提高资金的使用效率和周转速度。要合理确定债务资金与自有资金、短期资金与长期资金的比例关系，并随着企业生产的变化而变化，始终处于一种动态的管理过程中。要加强应收账款的风险防范与控制，建立一套科学、系统的应收账款体系，注重评估客户的财务状况和资信状况，谨慎签订合同，定期分析账龄，紧密跟踪应收账款的还款情况，合理制定收款政策，控制风险，减少坏账损失。对于存货，在保证生产和销售顺利进行的同时使存货总成本达到最低水平。在实际工作中，可以调查、总结已有的经验，运用存货管理中的最佳订货批量模型来确定存货量，以减少损失。同时，要理顺企业内部财务关系，做到责、权、利相统一，明确各部门在企业财务管理中的地位、作用及应承担的职责，并赋予相应的权力，真正做到权责分明，各负其责，使企业内部各种财务关系清晰明了，减少企业因管理不善而造成的财务风险。 5．合理利用防范风险的技术方法 现代企业可以利用多种方法来防范和规避财务风险，具体包括：(1)分散法。即通过企业之间联营、多种经营及对外投资多元化等方式分散财务风险。对于风险较大的投资项目，企业可以与其它企业共同投资，以实现收益共享、风险共担，避免企业独家承担投资而产生的财务风险。在多种经营方式下，某些产品因滞销而产生的损失，会被其他产品带来的收益所抵消，从而可避免单一经营产生的无法实现预期收益的风险。(2)回避法。即企业在选择理财方式时，应综合评价各种方案可能产生的财务风险，在保证财务管理目标的前提下，选择风险较小的方案，以达到回避财务风险的目的。一般来讲，长期投资的风险大于短期投资风险，股权投资风险大于债权投资风险，所以，企业选择投资方式时，尽可能采用风险低的债权投资和短期投资。 (3)转移法。企业在遵循合法、合理、公平、公正原则的基础上,可以采取措施转嫁风险。它包括保险转移和非保险转移。保险转移是指企业通过购买财务保险将财产损失的风险转移给保险公司承担；非保险转移是将某种特定风险转移给专门机构或部门。如对企业闲置的资产，采用出租或立即售出的处理方式，将资产损失的风险转移给承租方或购买方。(4)降低法。即企业面对客观存在的财务风险，努力采取措施降低财务风险的方法。如企业可在保证资金需要的前提下，适当降低负债资金占全部资金的比重。在生产经营活动中，可以通过提高产品质量、改进产品设计、开发新产品及开拓新市场等手段，降低因产品滞销、市场占有率下降而产生的不能实现预期收益的财务风险。另外，也可以按照稳健原则建立风险基金，以此降低风险损失对企业正常生产经营的影响。 6．建立有效的财务风险防范机制 企业应立足于市场，建立有效的风险防范和规避机制。首先，要建立完善的风险防范体系，健全财务风险管理机制，要抓好企业内控制度建设，明确企业财务风险监管职责，落实好分级负责制，建立经营者风险决策的激励与约束制度，以健全的奖惩体系为前提，鼓励经营者在公平竞争中进行经营管理活动并享受风险经营的收益，同时，要确保经营者能够担负起风险责任，承担风险损失。其次，企业要建立实时、全面、动态的财务预警系统，对企业在经营管理活动中的潜在风险进行实时监控。财务预警系统贯穿于企业经营活动的全过程，以企业的财务报表、经营计划及其他相关的财务资料为依据，利用财会、金融、企业管理、市场营销等理论，采用比例分析、数学模型等方法，对财务管理实施全过程监控，一旦发现某种异常征兆及时采取应变措施，以避免和减少风险损失。   ";
    public static final String RUDIMENT_SEVER = "   （一）长期形态比短期形态更重要\n" +
            "\n" +
            "短期的走势是在相对较小的区间中运动的，也容易受到各种各样因素的影响而随时变化。所以，投资者把握汇价的短期走势难度较大，容易陷入繁多的影响因素中而迷失方向。如果在分析短期汇价走势前对长期的走势有一个透彻的认识，做到胸有成竹，那么投资者就可以俯瞰短期走势，抓住主要矛盾，做出正确的分析判断。\n" +
            "\n" +
            "如汇价在几天时间内出现一个“早晨之星”形态，通常会认为汇价即将见底，反转的可能性较大，但也许从长期走势分析，汇价仍在长期下降通道运行，阻挡线没有任何被突破的可能性，那么，这时的“早晨之星”就只是一个小幅的反弹，是部分投资者平仓获利，市场消化压力的一个小调整，甚至连做短线的机会都没有。这时的“早晨之星”形态就没有反转的意义了。\n" +
            "\n" +
            "\n" +
            "（二）位置比形态更重要\n" +
            "\n" +
            "深入研究技术分析会发现，技术分析有无法的法则。但如果这些法则不结合位置形态来分析，那么这些法则就都成了空中楼阁，没有任何的意义。\n" +
            "\n" +
            "如“头肩底”形态是一个非常经典的底部反转形态，它通常出现在汇价的底部区域，但如果在汇价的高价区出现一个“头肩底”形态，那么成熟的投资者宁可退出市场观望，也决不会相信此形态。\n" +
            "\n" +
            "因为“在高位最可能出现头部，在低部最可能出现底部”是最朴素也是最有效的投资规律。\n" +
            "\n" +
            "（三）市场方向比位置更重要\n" +
            "\n" +
            "“汇价的高低不重要，汇价的趋势才是最重要的”。\n" +
            "\n" +
            "也许汇价已经达到很高或很低的区域，但只要投资者能够准确判断汇价的趋势，就仍然可以买进或者持有。投资者要分析的最重要的，最难的就是分析市场的走势方向。";
    public static final String RUDIMENT_EIGHT = "    第一：经济因素。\n" +
            "\n" +
            "在影响市场短期波动的经济新闻中，经济统计数据的公布对其影响最大。\n" +
            "\n" +
            "    利率政策。在所有的经济数据中，各个国家关于利率的调控以及政府出台的政策动向无疑是最重要的。有时政府虽然没有任何表示要改变政策，但只要交易市场有这种期待，市场会继续存在对这一政府会改变政策的期待，使这一国家的汇率出现大幅度波动。\n" +
            "\n" +
            "    非农数据。非农业人口就业人数的增减数和失业率是近几年影响交易市场短期波动的重要数据。这组数据是由美国劳工部在每月的第一个星期五公布。在市场看来，它是美国宏观经济的晴雨表，数字本身的好坏预示着美国经济前景的好坏。因此，在这组数字公布前的一、两天，只要市场上有任何关于这一数字可能不错的风言风语时，抛售风就会嘎然而止。\n" +
            "\n" +
            "    其他经济数据。包括工业生产、个人收入、国民生产总值、开工率、库存率、美国经济综合指标的先行指数、新住房开工率、汽车销售数等，但它们与非农业就业人口数相比，对市场的影响要小得多。\n" +
            "\n" +
            "    除了经济统计数据之外，其他关于经济活动的报道也会对市场产生一定的影响。我们需要明白的是价格的变动在很大程度上是市场上的人对波动的期待的反映。同时也是市场最后的趋势发展。\n" +
            "\n" +
            "　　第二：政治因素。\n" +
            "\n" +
            "交易市场受政治因素的影响要大得多。当某一件重大国际事件发生时，市场的涨落幅度会经常性地超过股市和债券市场的变化。其主要原因是作为国际性流动的资产，在动荡的政治格局下所面临的风险会比其他资产大;而市场的流动速度快，又进一步使市场在政治局面动荡时更加剧烈地波动。\n" +
            "\n" +
            "交易市场的政治风险主要有政局不稳引起经济政策变化、国有化措施等。政治事件经常是突发性事件，出乎市场的意料，这又使市场的现货价格异常剧烈地波动，其波动幅度大大超过价格的长期波动幅度。\n" +
            "\n" +
            "至于在政治性突发事件发生时，市场的波动幅度的极限有多大，始终是一个有争论的问题。一般认为，在突发性事件发生时，价格的波动完全由市场参与者的心理因素决定，取决于人们对这一事件的承受能力。\n" +
            "　　第三：政府对市场的直接干预。\n" +
            "\n" +
            "政府制定的政策和财政政策每天都影响着市场的价格波动。工业国家的中央银行对市场不但会透过制定政策和财政政策进行间接性的干预，还经常在市场异常剧烈的波动时，直接干预市场。这种政府对市场的直接干预也是影响市场短期走势的重要因素。";
    public static final String RUDIMENT_NINE = "    一、赢家重在观念正确:\n" +
            "\n" +
            "1 最好做熟悉的个股！忠告，轻易不抛牛股，毕业！选股正确，得半道。热点与强势股兼做，投资投机两相宜，得全道。\n" +
            "2 操盘手最重要的是盘中的应变能力。\n" +
            "3 定性是必须做好的。大周期定性，周线选股，月线鉴定，分时跟踪。\n" +
            "4 定法必依，用18日均量线与18日均价线来看行情。\n" +
            "5 能力无人教，全凭自己练，重复成功经验，让赚钱成为一种习惯，常赚比大赚更重要。\n" +
            "二、做强股是首选，高抛低吸，把钱赚。六大要素记心间：1.套庄；2.上线；3.过顶；4.洗盘；5.回补；6.上扬。\n" +
            "五大注意要牢记:\n" +
            "\n" +
            "1.高位不放量，安全有保障。\n" +
            "2.洗盘量比不放大，下跌再大不要怕。\n" +
            "3.上涨量比小，庄要咱也要。\n" +
            "4.量比放大真上攻,好时机莫踏空。\n" +
            "5.牛股也有调整期。\n" +
            "三、抓热点，是小资金快速获利的法宝。\n" +
            "1. 短线三指:股票的突破，主升浪，或弱极反弹。\n" +
            "2.短线精髓，出击低位首次放量，跳空高开，涨停板，伏击龙头只做短线爆发力极强的个股是实战的精髓。\n" +
            "3.短线基础，,短线进出，一定要建立在中线安全的基础上,把握爆发的精确时间。只有高速行进才能创造利润，小行情中也有天堂。\n" +
            "4.短线真功夫, 盘中做T+0是短线真功夫。\n" +
            "\n" +
            "5.短线特点与原则，热点三天，天天都有新特点，第一天，量大要封停，不封要调整，第二天，跳空上扬数它强。十字星，重心上移，缺口不补，主力不出，前进里程碑，倒拔扬柳，收阴不要怕，主力要筹码，第三天，量价背离要出局，坚决不要追。事不过三，高开低走把你骗，短线操作\"短、平、快\"三原则，超跌常有呈强时不能错过市场上的最主要上涨交易日。";
    public static final String RUDIMENT_TEN = "    股票中指标指衡量目标的单位或方法。股票指标是属于统计学的范畴，依据一定的数理统计方法，运用一些复杂的计算公式，一切以数据来论证股票趋向、买卖等的分析方法。\n" +
            "　　股票指标主要有动量指标、相对强弱指数、随机指数等等。由于以上的分析往往需要一定的电脑软件的支持，所以对于个人实盘买卖交易的投资者，只作为一般了解。但值得一提的是，技术指标分析是国际市场上的职业交易员非常倚重的汇率分析与预测工具。新兴的电子现货市场也有类似一些指标的运用，电子现货之家中有所介绍。\n" +
            "\n" +
            "1.当DIF由下向上突破DEA，形成黄金交叉，既白色的DIF上穿黄色的DEA形成的交叉。或者BAR（绿柱线）缩短，为买入信号。 \n" +
            "2.当DIF由上向下突破DEA，形成死亡交叉，既白色的DIF下穿黄色的DEA形成的交叉。或者BAR(红柱线)缩短，为卖出信号。 \n" +
            "3.顶背离:当股价指数逐波升高，而DIF及DEA不是同步上升，而是逐波下降，与股价走势形成顶背离。预示股价即将下跌。如果此时出现DIF两次由上向下穿过DEA，形成两次死亡交叉，则股价将大幅下跌。\n" +
            "4.底背离:当股价指数逐波下行，而DIF及DEA不是同步下降，而是逐波上升，与股价走势形成底背离，预示着股价即将上涨。如果此时出现DIF两次由下向上穿过DEA，形成两次黄金交叉，则股价即将大幅度上涨。 \n" +
            "MACD指标主要用于对大势中长期的上涨或下跌趋势进行判断，当股价处于盘局或指数波动不明显时，MACD买卖信号较不明显。当股价在短时间内上下波动较大时，因MACD的移动相当缓慢，所以不会立即对股价的变动产生买卖信号。\n" +
            "MACD主要是利用长短期的二条平滑平均线，计算两者之间的差离值，作为研判行情买卖之依据。MACD指标是基于均线的构造原理，对价格收盘价进行平滑处理(求出算术平均值)后的一种趋向类指标。它主要由两部分组成，即正负差(DIF)、异同平均数(DEA)，其中，正负差是核心，DEA是辅助。DIF是快速平滑移动平均线(EMA1)和慢速平滑移动平均线(EMA2)的差。\n" +
            "在现有的技术分析软件中，MACD常用参数是快速平滑移动平均线为12，慢速平滑移动平均线参数为26。此外，MACD还有一个辅助指标——柱状线(BAR)。在大多数技术分析软件中，柱状线是有颜色的，在低于0轴以下是绿色，高于0轴以上是红色，前者代表趋势较弱，后者代表趋势较强。 \n" +
            "下面我们来说一下使用MACD指标所应当遵循的基本原则: \n" +
            "1.当DIF和DEA处于0轴以上时，属于多头市场，DIF线自下而上穿越DEA线时是买入信号。DIF线自上而下穿越DEA线时，如果两线值还处于0轴以上运行，仅仅只能视为一次短暂的回落，而不能确定趋势转折，此时是否卖出还需要借助其他指标来综合判断。 \n" +
            "2.当DIF和DEA处于0轴以下时，属于空头市场。DIF线自上而下穿越DEA线时是卖出信号，DIF线自下而上穿越DEA线时，如果两线值还处于0轴以下运行，仅仅只能视为一次短暂的反弹，而不能确定趋势转折，此时是否买入还需要借助其他指标来综合判断。 \n" +
            "3.柱状线收缩和放大。一般来说，柱状线的持续收缩表明趋势运行的强度正在逐渐减弱，当柱状线颜色发生改变时，趋势确定转折。但在一些时间周期不长的MACD指标使用过程中，这一观点并不能完全成立。 \n" +
            "4.形态和背离情况。MACD指标也强调形态和背离现象。当形态上MACD指标的DIF线与MACD线形成高位看跌形态，如头肩顶、双头等，应当保持警惕；而当形态上MACD指标DIF线与MACD线形成低位看涨形态时，应考虑进行买入。在判断形态时以DIF线为主，MACD线为辅。当价格持续升高，而MACD指标走出一波比一波低的走势时，意味着顶背离出现，预示着价格将可能在不久之后出现转头下行，当价格持续降低，而MACD指标却走出一波高于一波的走势时，意味着底背离现象的出现，预示着价格将很快结束下跌，转头上涨。 \n" +
            "5.牛皮市道中指标将失真。当价格并不是自上而下或者自下而上运行，而是保持水平方向的移动时，我们称之为牛皮市道，此时虚假信号将在MACD指标中产生，指标DIF线与MACD线的交叉将会十分频繁，同时柱状线的收放也将频频出现，颜色也会常常由绿转红或者由红转绿，此时MACD指标处于失真状态，使用价值相应降低。 \n" +
            "用DIF的曲线形状进行分析，主要是利用指标相背离的原则。具体为:如果DIF的走向与股价走向相背离，则是采取具体行动的时间。但是，根据以上原则来指导实际操作，准确性并不能令人满意。经过实践、摸索和总结，综合运用5日、10日均价线，5日、10日均量线和MACD，其准确性大为提高。";

}
